apache/nuttx/configs/samv71-xult/src/sam_ili9488.c
#include "cache.h"
#include "up_arch.h"
#include "sam_gpio.h"
#include "sam_periphclks.h"
#include "sam_xdmac.h"
#include "chip/sam_pmc.h"
#include "chip/sam_smc.h"
#include "chip/sam_pinmap.h"

#include "samv71-xult.h"
#include "atmxt-xpro.h"

#ifdef HAVE_ILI9488_SMC

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/
/* SMC must be selected */

#if !defined(CONFIG_SAMV7_SMC)
#  error "CONFIG_SAMV7_SMC is required"
#endif

/* Check contrast selection */

#if !defined(CONFIG_LCD_MAXCONTRAST)
#  define CONFIG_LCD_MAXCONTRAST 1
#endif

/* Check power setting */

#if !defined(CONFIG_LCD_MAXPOWER)
#  define CONFIG_LCD_MAXPOWER 16
#endif

#if CONFIG_LCD_MAXPOWER > 255
#  error "CONFIG_LCD_MAXPOWER must be less than 256 to fit in uint8_t"
#endif

/* Check orientation */

#if defined(CONFIG_LCD_LANDSCAPE)
#  if defined(CONFIG_LCD_PORTRAIT) || defined(CONFIG_LCD_RPORTRAIT) || \
      defined(CONFIG_LCD_RLANDSCAPE)
#    error "Cannot define both portrait and any other orientations"
#  endif
#elif defined(CONFIG_LCD_RLANDSCAPE)
#  if defined(CONFIG_LCD_PORTRAIT) || defined(CONFIG_LCD_RPORTRAIT)
#    error "Cannot define both rportrait and any other orientations"
#  endif
#elif defined(CONFIG_LCD_PORTRAIT)
#  ifdef CONFIG_LCD_RPORTRAIT
#    error "Cannot define both landscape and any other orientations"
#  endif
#elif !defined(CONFIG_LCD_RPORTRAIT)
#  define CONFIG_LCD_LANDSCAPE 1
#endif

/* Background color */

#if !defined(CONFIG_SAMV71XULT_LCD_BGCOLOR)
#  define CONFIG_SAMV71XULT_LCD_BGCOLOR 0
#endif

/* Display/Color Properties **************************************************/
/* Display Resolution */

#if defined(CONFIG_LCD_LANDSCAPE) || defined(CONFIG_LCD_RLANDSCAPE)
#  define SAM_XRES            480
#  define SAM_YRES            320
#else
#  define SAM_XRES            320
#  define SAM_YRES            480
#endif

/* Color depth and format */

#define SAM_BPP               16
#define SAM_COLORFMT          FB_FMT_RGB16_565

/* Color decoding macros */

#define RGB_RED(rgb)          RGB16RED(rgb)
#define RGB_GREEN(rgb)        RGB16GREEN(rgb)
#define RGB_BLUE(rgb)         RGB16BLUE(rgb)
#define RGB_COLOR(r,g,b)      RGBTO16(r,g,b)

/* SAMV7-XULT LCD Hardware Definitions ***************************************/
/* LCD /CS is NCS3 */

#define SAM_LCD_BASE          ((uintptr_t)SAM_EXTCS3_BASE)
#define SAM_LCD_CS            3

/* Backlight */

#define BKL_LEVELS            16
#define BKL_PULSE_DURATION    24
#define BKL_ENABLE_DURATION   (128*1024)
#define BKL_DISABLE_DURATION  (128*1024)

/* DMA */

#define DMA_FLAGS \
  DMACH_FLAG_PERIPHPID(0) | DMACH_FLAG_PERIPHAHB_AHB_IF1 | \
  DMACH_FLAG_PERIPHWIDTH_16BITS | DMACH_FLAG_PERIPHCHUNKSIZE_1 | \
  DMACH_FLAG_MEMPID(0) | DMACH_FLAG_MEMAHB_AHB_IF0 | \
  DMACH_FLAG_MEMWIDTH_16BITS | DMACH_FLAG_MEMINCREMENT | \
  DMACH_FLAG_MEMCHUNKSIZE_1 | DMACH_FLAG_MEMBURST_1

/* DMA timeout.  The value is not critical; we just don't want the system to
 * hang in the event that a DMA does not finish.  This is set to
 */

#define DMA_TIMEOUT_MS        (800)
#define DMA_TIMEOUT_TICKS     MSEC2TICK(DMA_TIMEOUT_MS)

/* Buffer Alignment.
 *
 * If the data cache is enabled the a higher level of alignment is required.  That is
 * because the data will need to be invalidated and that cache invalidation will occur
 * in multiples of full change lines.
 */

#ifdef CONFIG_ARMV7M_DCACHE
/* Align to the cache line size which we assume is >= 8 */

#  define LCD_ALIGN            ARMV7M_DCACHE_LINESIZE
#  define LCD_ALIGN_MASK       (LCD_ALIGN-1)
#  define LCD_ALIGN_UP(n)      (((n) + LCD_ALIGN_MASK) & ~LCD_ALIGN_MASK)

#  define LCD_RUNBUFFER_BYTES  LCD_ALIGN_UP(SAM_XRES * sizeof(uint16_t))
#  define LCD_RUNBUFFER_PIXELS (LCD_RUNBUFFER_BYTES / sizeof(uint16_t))

#else
/* Align to 2-byte boundaries */

#  define LCD_ALIGN            2
#  define LCD_ALIGN_MASK       1
#  define LCD_ALIGN_UP(n)      (((n) + 1) & ~1)

#  define LCD_RUNBUFFER_BYTES  SAM_XRES * sizeof(uint16_t)
#  define LCD_RUNBUFFER_PIXELS SAM_XRES
#endif

/* Debug *********************************************************************/

#ifdef CONFIG_DEBUG_DMA
#  define SAMPLENDX_BEFORE_SETUP  0
#  define SAMPLENDX_AFTER_SETUP   1
#  define SAMPLENDX_DMA_CALLBACK  2
#  define SAMPLENDX_TIMEOUT       3
#  define DEBUG_NDMASAMPLES       4
#endif

/****************************************************************************
 * Private Type Definition
 ****************************************************************************/

/* Type definition for the correct size of one pixel (from the application
 * standpoint).
 */

#ifdef CONFIG_SAMV71XULT_LCD_RGB565
typedef uint16_t sam_color_t;
#else /* RGB888 or RGB32 (without ALPHA) */
typedef uint32_t sam_color_t;
#endif

/* This structure describes the LCD registers */

struct lcd_regs_s
{
  volatile uint16_t index;
  volatile uint16_t value;
};

/* This structure describes the state of this driver */

struct sam_dev_s
{
  /* Publicly visible device structure */

  struct lcd_dev_s dev;

  /* Allocated DMA channel */

  DMA_HANDLE dmach;
  WDOG_ID dmadog;         /* For DMA timeout detection */
  volatile int result;    /* Result of the DMA transfer */
  sem_t waitsem;          /* Used to way for DMA completion */
  volatile bool dmabusy;  /* True: DMA is in progress */
  volatile bool cmd;      /* True: Command transfer */

  /* Private LCD-specific information follows */

  uint8_t power;          /* Current power setting */
  bool output;            /* True: Configured for output */
#ifdef CONFIG_DEBUG_DMA
  uint8_t smplset;
  struct sam_dmaregs_s samples[DEBUG_NDMASAMPLES];
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/
/* Low Level LCD access */

static int  sam_sendcmd(FAR struct sam_dev_s *priv, uint16_t cmd);
static int  sam_lcd_put(FAR struct sam_dev_s *priv, uint16_t cmd,
              FAR const uint16_t *buffer, unsigned int buflen);
static int  sam_lcd_get(FAR struct sam_dev_s *priv, uint8_t cmd,
              FAR uint16_t *buffer, unsigned int buflen);
static int  sam_lcd_getreg(FAR struct sam_dev_s *priv, uint8_t cmd,
              FAR uint8_t *buffer, unsigned int nbytes);
static int  sam_setwindow(FAR struct sam_dev_s *priv, sam_color_t row,
              sam_color_t col, sam_color_t width, sam_color_t height);

/* Backlight/power controls */

static void sam_disable_backlight(void);
static int  sam_set_backlight(unsigned int power);
static int  sam_poweroff(FAR struct sam_dev_s *priv);

/* DMA Helpers */

#ifdef CONFIG_DMA_DEBUG
static void sam_lcd_sample(FAR struct sam_dev_s *priv, int index);
static void sam_lcd_sampleinit(FAR struct sam_dev_s *priv);
static void sam_lcd_dumpone(FAR struct sam_dev_s *priv, int index,
              FAR const char *msg);
static void sam_lcd_dump(struct sam_dev_s *priv);
#else
#  define sam_lcd_sample(priv, index)
#  define sam_lcd_sampleinit(priv)
#  define sam_lcd_dump(priv)
#endif

static void sam_lcd_endwait(struct sam_dev_s *priv, int result);
static void sam_lcd_dmatimeout(int argc, uint32_t arg);
static int  sam_lcd_dmawait(FAR struct sam_dev_s *priv, uint32_t timeout);
static void sam_lcd_dmacallback(DMA_HANDLE handle, void *arg, int result);
static int  sam_lcd_txtransfer(FAR struct sam_dev_s *priv,
              FAR const uint16_t *buffer, unsigned int buflen);
static int  sam_lcd_rxtransfer(FAR struct sam_dev_s *priv,
              FAR const uint16_t *buffer, unsigned int buflen);

/* LCD Data Transfer Methods */

static int  sam_putrun(fb_coord_t row, fb_coord_t col, FAR const uint8_t *buffer,
              size_t npixels);
static int  sam_getrun(fb_coord_t row, fb_coord_t col, FAR uint8_t *buffer,
              size_t npixels);

