apache/nuttx/configs/samv71-xult/src/sam_ili9488.c
/* LCD Configuration */

static int  sam_getvideoinfo(FAR struct lcd_dev_s *dev,
              FAR struct fb_videoinfo_s *vinfo);
static int  sam_getplaneinfo(FAR struct lcd_dev_s *dev, unsigned int planeno,
              FAR struct lcd_planeinfo_s *pinfo);

/* LCD RGB Mapping */

#ifdef CONFIG_FB_CMAP
#  error "RGB color mapping not supported by this driver"
#endif

/* Cursor Controls */

#ifdef CONFIG_FB_HWCURSOR
#  error "Cursor control not supported by this driver"
#endif

/* LCD Specific Controls */

static int  sam_getpower(FAR struct lcd_dev_s *dev);
static int  sam_setpower(FAR struct lcd_dev_s *dev, int power);
static int  sam_getcontrast(FAR struct lcd_dev_s *dev);
static int  sam_setcontrast(FAR struct lcd_dev_s *dev, unsigned int contrast);

/* Initialization */

static void sam_gpio_initialize(void);
static inline void sam_smc_initialize(void);
static inline int sam_lcd_initialize(void);

/****************************************************************************
 * Private Data
 ****************************************************************************/
/* LCD GPIO configurations */

static const uint32_t g_lcdpin[] =
{
  GPIO_SMC_D0,      GPIO_SMC_D1,      GPIO_SMC_D2,      GPIO_SMC_D3,  /* D0-D3 */
  GPIO_SMC_D4,      GPIO_SMC_D5,      GPIO_SMC_D6,      GPIO_SMC_D7,  /* D4-D7 */
  GPIO_SMC_D8,      GPIO_SMC_D9,      GPIO_SMC_D10,     GPIO_SMC_D11, /* D8-D11 */
  GPIO_SMC_D12,     GPIO_SMC_D13,     GPIO_SMC_D14,     GPIO_SMC_D15, /* D12-15 */
  GPIO_SMC_NWE,     GPIO_SMC_NRD,     GPIO_SMC_NCS3,                  /* RD, WR, CS */
  GPIO_ILI9488_CDS, GPIO_ILI9488_RST, GPIO_ILI9488_BKL                /* PIO outputs */
};
#define LCD_NPINS (sizeof(g_lcdpin) / sizeof(uint32_t))

/* This is working memory allocated by the LCD driver for each LCD device
 * and for each color plane.  This memory will hold one raster line of data.
 * The size of the allocated run buffer must therefore be at least
 * (bpp * xres / 8).  Actual alignment of the buffer must conform to the
 * bitwidth of the underlying pixel type.
 *
 * If there are multiple planes, they may share the same working buffer
 * because different planes will not be operate on concurrently.  However,
 * if there are multiple LCD devices, they must each have unique run buffers.
 */

static uint16_t g_runbuffer[LCD_RUNBUFFER_BYTES] __attribute__((aligned(LCD_ALIGN)));

/* This structure describes the overall LCD video controller */

static const struct fb_videoinfo_s g_videoinfo =
{
  .fmt     = SAM_COLORFMT,         /* Color format: RGB16-565: RRRR RGGG GGGB BBBB */
  .xres    = SAM_XRES,             /* Horizontal resolution in pixel columns */
  .yres    = SAM_YRES,             /* Vertical resolution in pixel rows */
  .nplanes = 1,                    /* Number of color planes supported */
};

/* This is the standard, NuttX Plane information object */

static const struct lcd_planeinfo_s g_planeinfo =
{
  .putrun = sam_putrun,            /* Put a run into LCD memory */
  .getrun = sam_getrun,            /* Get a run from LCD memory */
  .buffer = (uint8_t*)g_runbuffer, /* Run scratch buffer */
  .bpp    = SAM_BPP,               /* Bits-per-pixel */
};

/* This is the ILI9488 LCD driver object */

static struct sam_dev_s g_lcddev =
{
  /* This is the contained standard, NuttX LCD driver object */

  .dev =
  {
    /* LCD Configuration */

    .getvideoinfo = sam_getvideoinfo,
    .getplaneinfo = sam_getplaneinfo,

    /* LCD RGB Mapping -- Not supported */
    /* Cursor Controls -- Not supported */

    /* LCD Specific Controls */

    .getpower     = sam_getpower,
    .setpower     = sam_setpower,
    .getcontrast  = sam_getcontrast,
    .setcontrast  = sam_setcontrast,
  },
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: sam_sendcmd
 *
 * Description:
 *  Send an ILI9488 command byte
 *
 ****************************************************************************/

static int sam_sendcmd(FAR struct sam_dev_s *priv, uint16_t cmd)
{
  volatile int i;
  int ret;

  /* Set the CDS GPIO output low (command) */

  sam_gpiowrite(GPIO_ILI9488_CDS, false);

  /* Send the command via TX DMA */

  ret = sam_lcd_txtransfer(priv, &cmd, sizeof(uint16_t));
  if (ret < 0)
    {
      lcderr("ERROR: Failed to send command %02x: %d\n", cmd, ret);
    }

  /* Make sure that the CMD/DATA GPIO is reset for commands.  I don't understand
   * the delay loop... it comes from the SAMV7 sample code and is, apparently, a
   * work-around for some issue.
   */

  for (i = 0; i < 15; i++);

  /* Set the CDS OUTPUT to high (data) */

  sam_gpiowrite(GPIO_ILI9488_CDS, true);
  return ret;
}

/****************************************************************************
 * Name:  sam_lcd_put
 *
 * Description:
 *   Write to a multi-byte ILI9488 register
 *
 ****************************************************************************/

static int sam_lcd_put(FAR struct sam_dev_s *priv, uint16_t cmd,
                       FAR const uint16_t *buffer, unsigned int buflen)
{
  int ret;

  /* Send the command */

  ret = sam_sendcmd(priv, cmd);
  if (ret < 0)
    {
      return ret;
    }

  /* If the command was sent successfully, then send any accompanying data */

  if (buflen > 0)
    {
      ret = sam_lcd_txtransfer(priv, buffer, buflen);
      if (ret < 0)
        {
          lcderr("ERROR: Failed to send command %02x data: %d\n", cmd, ret);
       }
    }

  return ret;
}

/****************************************************************************
 * Name:  sam_lcd_get
 *
 * Description:
 *   Send a command and read 16-bit data from the ILI9488
 *
 ****************************************************************************/

static int sam_lcd_get(FAR struct sam_dev_s *priv, uint8_t cmd,
                       FAR uint16_t *buffer, unsigned int buflen)
{
  int ret;

