apache/nuttx/configs/samv71-xult/src/sam_ili9488.c
  /* Send the command */

  ret = sam_sendcmd(priv, cmd);

  /* If the command was sent successfully, then receive any accompanying data */

  if (ret == OK && buflen > 0)
    {
      ret = sam_lcd_rxtransfer(priv, buffer, buflen);
    }

  return ret;
}

/****************************************************************************
 * Name:  sam_lcd_getreg
 *
 * Description:
 *   Read from a multi-byte ILI9488 register
 *
 ****************************************************************************/

static int sam_lcd_getreg(FAR struct sam_dev_s *priv, uint8_t cmd,
                          FAR uint8_t *buffer, unsigned int nbytes)
{
  uint32_t tmp[4];
  int ret;
  int i;

  DEBUGASSERT(nbytes <= 4);

  /* Read the request number of bytes (as 16-bit values) plus a leading
   * dummy read.
   */

  ret = sam_lcd_get(priv, cmd, (FAR uint16_t *)tmp, nbytes << 2);
  if (ret == OK)
    {
      for (i = 0; i < nbytes; i++)
        {
          buffer[i] = tmp[i] & 0xff;
        }
    }

  return ret;
}

/****************************************************************************
 * Name:  sam_setwindow
 *
 * Description:
 *   Setup drawing window
 *
 ****************************************************************************/

static int sam_setwindow(FAR struct sam_dev_s *priv, sam_color_t row,
                         sam_color_t col, sam_color_t width,
                         sam_color_t height)
{
  uint16_t buffer[4];
  int ret;

  lcdinfo("row=%d col=%d width=%d height=%d\n", row, col, width, height);

  /* Set Column Address Position */

  buffer[0] = (col >> 8) & 0xff;
  buffer[1] = col & 0xff;
  buffer[2] = ((col + width - 1) >> 8) & 0xff;
  buffer[3] = (col + width - 1) & 0xff;
  ret = sam_lcd_put(priv, ILI9488_CMD_COLUMN_ADDRESS_SET, buffer,
                    4 * sizeof(uint16_t));
  if (ret < 0)
    {
      return ret;
    }

  ret = sam_sendcmd(priv, ILI9488_CMD_NOP);
  if (ret < 0)
    {
      return ret;
    }

  /* Set Page Address Position */

  buffer[0] = (row >> 8) & 0xff;
  buffer[1] = row & 0xff;
  buffer[2] = ((row + height - 1) >> 8) & 0xff;
  buffer[3] = (row + height - 1) & 0xff;
  ret = sam_lcd_put(priv, ILI9488_CMD_PAGE_ADDRESS_SET, buffer,
                    4 * sizeof(uint16_t));
  if (ret < 0)
    {
      return ret;
    }

  return sam_sendcmd(priv, ILI9488_CMD_NOP);
}

/****************************************************************************
 * Name:  sam_dumprun
 *
 * Description:
 *   Dump the contexts of the run buffer:
 *
 *  run     - The buffer in containing the run read to be dumped
 *  npixels - The number of pixels to dump
 *
 ****************************************************************************/

#if 0 /* Sometimes useful */
static void sam_dumprun(FAR const char *msg, FAR uint16_t *run, size_t npixels)
{
  int i, j;

  syslog(LOG_DEBUG, "\n%s:\n", msg);
  for (i = 0; i < npixels; i += 16)
    {
      up_putc(' ');
      syslog(LOG_DEBUG, " ");
      for (j = 0; j < 16; j++)
        {
          syslog(LOG_DEBUG, " %04x", *run++);
        }

      up_putc('\n');
    }
}
#endif

/****************************************************************************
 * Name:  sam_disable_backlight
 *
 * Description:
 *   Turn the backlight off.
 *
 ****************************************************************************/

static void sam_disable_backlight(void)
{
  /* PWM support is not yet available.  Backlight is currently just configured as a
   * GPIO output.
   */
#warning Missing logic

  sam_gpiowrite(GPIO_ILI9488_BKL, false);
}

/****************************************************************************
 * Name:  sam_set_backlight
 *
 * Description:
 *   The the backlight to the level associated with the specified power value.
 *
 ****************************************************************************/

static int sam_set_backlight(unsigned int power)
{
  lcdinfo("power=%d\n", power);

  /* PWM support is not yet available.  Backlight is currently just
   * configured as a GPIO output.
   */
#warning Missing logic

  if (power > 0)
    {
      sam_gpiowrite(GPIO_ILI9488_BKL, true);
    }
  else
    {
      sam_gpiowrite(GPIO_ILI9488_BKL, false);
    }

  return OK;
}

/****************************************************************************
 * Name:  sam_poweroff
 *
 * Description:
 *   Enable/disable LCD panel power (0: full off - CONFIG_LCD_MAXPOWER:
  *  full on). On backlit LCDs, this setting may correspond to the backlight
  *  setting.
 *
 ****************************************************************************/

static int sam_poweroff(FAR struct sam_dev_s *priv)
{
  int ret;

  lcdinfo("OFF\n");

  /* Turn the display off */

  ret = sam_lcd_put(priv, ILI9488_CMD_DISPLAY_OFF, NULL, 0);

  /* Disable the backlight */

  sam_disable_backlight();

  /* Remember the power off state */

  priv->power = 0;
  return ret;
}

/****************************************************************************
 * Name: sam_lcd_sample
 *
 * Description:
 *   Sample HSMCI/DMA registers
 *
 ****************************************************************************/

#ifdef CONFIG_DMA_DEBUG
static void sam_lcd_sample(struct sam_dev_s *priv, int index)
{
  /* On a multiple block transfer, only sample on the first block */

  if ((priv->smplset & (1 << index)) == 0)
    {
      sam_dmasample(priv->dmach, &priv->samples[index]);
      priv->smplset |= (1 << index);
    }
}
#endif

/****************************************************************************
 * Name: sam_lcd_sampleinit
 *
 * Description:
 *   Setup prior to collecting DMA samples
 *
 ****************************************************************************/

#ifdef CONFIG_DMA_DEBUG
static void sam_lcd_sampleinit(struct sam_dev_s *priv)
{
  priv->smplset = 0;
  memset(priv->samples, 0xff, DEBUG_NDMASAMPLES * sizeof(struct sam_dmaregs_s));
}
#endif

/****************************************************************************
 * Name: sam_lcd_dumpone
 *
 * Description:
 *   Dump one transfer register sample
 *
 ****************************************************************************/

#ifdef CONFIG_DMA_DEBUG
static void sam_lcd_dumpone(struct sam_dev_s *priv, int index,
                                const char *msg)
{
  if ((priv->smplset & (1 << index)) != 0)
    {
      sam_dmadump(priv->dmach, &priv->samples[index], msg);
    }
  else
    {
      finfo("%s: Not collected\n", msg);
    }
}
#endif

/****************************************************************************
 * Name: sam_lcd_dump
 *
 * Description:
 *   Dump all transfer-related, sampled register data
 *
 ****************************************************************************/

#ifdef CONFIG_DMA_DEBUG
static void  sam_lcd_dump(struct sam_dev_s *priv)
{
  sam_lcd_dumpone(priv, SAMPLENDX_BEFORE_SETUP, "Before setup");
  sam_lcd_dumpone(priv, SAMPLENDX_AFTER_SETUP, "After setup");
  sam_lcd_dumpone(priv, SAMPLENDX_END_TRANSFER, "End of transfer");
  sam_lcd_dumpone(priv, SAMPLENDX_DMA_CALLBACK, "DMA Callback");
  sam_lcd_dumpone(priv, SAMPLENDX_TIMEOUT, "Timeout");
  priv->smplset = 0;
}
#endif

/****************************************************************************
 * Name: sam_lcd_endwait
 *
 * Description:
 *   Wake up a waiting thread if the waited-for event has occurred.
 *
 * Input Parameters:
 *   priv      - An instance of the HSMCI device interface
 *   wkupevent - The event that caused the wait to end
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

static void sam_lcd_endwait(struct sam_dev_s *priv, int result)
{
  /* Save the result and cancel the watchdog timeout */

  (void)wd_cancel(priv->dmadog);
  priv->result = result;

  /* Wake up the waiting thread */

  nxsem_post(&priv->waitsem);
}

/****************************************************************************
 * Name: sam_lcd_dmatimeout
 *
 * Description:
 *   The watchdog timeout setup when the DMA was startd.  Indicates a DMA
 *   timeout failure.
 *
 * Input Parameters:
 *   argc   - The number of arguments (should be 1)
 *   arg    - The argument (state structure reference cast to uint32_t)
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Always called from the interrupt level with interrupts disabled.
 *
 ****************************************************************************/

static void sam_lcd_dmatimeout(int argc, uint32_t arg)
{
  struct sam_dev_s *priv = (struct sam_dev_s *)arg;

  DEBUGASSERT(argc == 1 && priv != NULL);
  sam_lcd_sample((struct sam_dev_s *)arg, SAMPLENDX_TIMEOUT);

  /* Make sure that any hung DMA is stopped.  dmabusy == false is the cue
   * so the DMA callback is ignored.
   */

  priv->dmabusy = false;
  sam_dmastop(priv->dmach);

  /* The wake up the waiting client a timeout error */

  sam_lcd_endwait(priv, -ETIMEDOUT);
}

/****************************************************************************
 * Name: sam_lcd_dmawait
 *
 * Description:
 *   Wait for one either (1) the DMA to complete, or (2) a DMA timeout to
 *   occur.
 *
 * Input Parameters:
 *   dev     - An instance of the SDIO device interface
 *   timeout - Maximum time in milliseconds to wait.  Zero means immediate
 *             timeout with no wait.
 *
 * Returned Value:
 *   The result of the DMA transfer
 *
 ****************************************************************************/

static int sam_lcd_dmawait(FAR struct sam_dev_s *priv, uint32_t timeout)
{
  int ret;

  /* Started ... setup the timeout */

  ret = wd_start(priv->dmadog, timeout, (wdentry_t)sam_lcd_dmatimeout,
                 1, (uint32_t)priv);
  if (ret < 0)
    {
      lcderr("ERROR: wd_start failed: %d\n", errno);
    }

  /* Loop until the event (or the timeout occurs). */

  while (priv->result == -EBUSY)
    {
      /* Wait for an event in event set to occur.  If this the event has
       * already occurred, then the semaphore will already have been
       * incremented and there will be no wait.
       */

      ret = nxsem_wait(&priv->waitsem);

