apache/nuttx/configs/samv71-xult/src/sam_ili9488.c
      /* The only expected failure is EINTR */

      DEBUGASSERT(ret == OK || ret == -EINTR);
    }

  /* Dump the collect DMA sample data */

  sam_lcd_dump(priv);
  return priv->result;
}

/****************************************************************************
 * Name: sam_lcd_dmacallback
 *
 * Description:
 *   Called when HSMCI DMA completes
 *
 ****************************************************************************/

static void sam_lcd_dmacallback(DMA_HANDLE handle, void *arg, int result)
{
  struct sam_dev_s *priv = (struct sam_dev_s *)arg;

  /* Is DMA still active?  We can get this callback when sam_dmastop() is
   * called too.
   */

  if (priv->dmabusy)
    {
      /* Sample DMA registers */

      priv->dmabusy = false;
      sam_lcd_sample((struct sam_dev_s *)arg, SAMPLENDX_DMA_CALLBACK);

      /* Wake-up the waiting client */

      sam_lcd_endwait(priv, result);
    }
}

/****************************************************************************
 * Name: sam_lcd_txtransfer
 *
 * Description:
 *   Perform a TX DMA transfer (memory-to-LCD)
 *
 ****************************************************************************/

static int sam_lcd_txtransfer(FAR struct sam_dev_s *priv,
                              FAR const uint16_t *buffer, unsigned int buflen)
{
  irqstate_t flags;
  int ret;

  priv->dmabusy = true;
  priv->result  = -EBUSY;

  /* Set up to transfer to the LCD */

  ret = sam_dmatxsetup(priv->dmach, (uint32_t)SAM_LCD_BASE, (uint32_t)buffer, buflen);
  if (ret == OK)
    {
      flags = enter_critical_section();

      /* The setup was successful, start the DMA */

      ret = sam_dmastart(priv->dmach, sam_lcd_dmacallback, priv);
      if (ret == OK)
        {
          /* Started ... Wait for the DMA (or timeout) to complete */

          ret = sam_lcd_dmawait(priv, DMA_TIMEOUT_TICKS);
        }

      leave_critical_section(flags);
    }

  priv->dmabusy = false;
  return ret;
}

/****************************************************************************
 * Name: sam_lcd_rxtransfer
 *
 * Description:
 *   Perform a RX DMA transfer (LCD-to-memory)
 *
 ****************************************************************************/

static int sam_lcd_rxtransfer(FAR struct sam_dev_s *priv,
                              FAR const uint16_t *buffer, unsigned int buflen)
{
  irqstate_t flags;
  int ret;

  priv->dmabusy = true;
  priv->result  = -EBUSY;

  /* Set up to transfer to the LCD */

  ret = sam_dmarxsetup(priv->dmach, (uint32_t)SAM_LCD_BASE, (uint32_t)buffer, buflen);
  if (ret == OK)
    {
      flags = enter_critical_section();

      /* The setup was successful, start the DMA */

      ret = sam_dmastart(priv->dmach, sam_lcd_dmacallback, priv);
      if (ret == OK)
        {
          /* Started ... Wait for the DMA (or timeout) to complete */

          ret = sam_lcd_dmawait(priv, DMA_TIMEOUT_TICKS);
        }

      leave_critical_section(flags);
    }

  priv->dmabusy = false;
  return ret;
}

/****************************************************************************
 * Name:  sam_putrun
 *
 * Description:
 *   This method can be used to write a partial raster line to the LCD:
 *
 *   row     - Starting row to write to (range: 0 <= row < yres)
 *   col     - Starting column to write to (range: 0 <= col <= xres-npixels)
 *   buffer  - The buffer containing the run to be written to the LCD
 *   npixels - The number of pixels to write to the LCD
 *             (range: 0 < npixels <= xres-col)
 *
 ****************************************************************************/

static int sam_putrun(fb_coord_t row, fb_coord_t col,
                      FAR const uint8_t *buffer, size_t npixels)
{
  FAR struct sam_dev_s *priv = &g_lcddev;
  int ret;

  /* Buffer must be provided and aligned to a 16-bit address boundary */

  lcdinfo("row: %d col: %d npixels: %d\n", row, col, npixels);
  DEBUGASSERT(buffer && ((uintptr_t)buffer & 1) == 0);

  /* Determine the refresh window area */

  ret = sam_setwindow(priv, row, col, npixels, 1);
  if (ret < 0)
    {
      lcderr("ERROR: sam_setwindow failed: %d\n",  ret);
      return ret;
    }

  /* Write the run into the LCD */

  return sam_lcd_put(priv, ILI9488_CMD_MEMORY_WRITE,
                    (FAR const uint16_t *)buffer,
                     npixels * sizeof(uint16_t));
}

/****************************************************************************
 * Name:  sam_getrun
 *
 * Description:
 *   This method can be used to read a partial raster line from the LCD:
 *
 *  row     - Starting row to read from (range: 0 <= row < yres)
 *  col     - Starting column to read read (range: 0 <= col <= xres-npixels)
 *  buffer  - The buffer in which to return the run read from the LCD
 *  npixels - The number of pixels to read from the LCD
 *            (range: 0 < npixels <= xres-col)
 *
 ****************************************************************************/

static int sam_getrun(fb_coord_t row, fb_coord_t col, FAR uint8_t *buffer,
                      size_t npixels)
{
  FAR struct sam_dev_s *priv = &g_lcddev;
  int ret;

  /* Buffer must be provided and aligned to a 16-bit address boundary */

  lcdinfo("row: %d col: %d npixels: %d\n", row, col, npixels);
  DEBUGASSERT(buffer && ((uintptr_t)buffer & 1) == 0);

  /* Determine the refresh window area */

  ret = sam_setwindow(priv, row, col, npixels, 1);
  if (ret < 0)
    {
      lcderr("ERROR: sam_setwindow failed: %d\n",  ret);
      return ret;
    }

  /* Write the run into the LCD */

  return sam_lcd_get(priv, ILI9488_CMD_MEMORY_READ, (FAR uint16_t *)buffer,
                     npixels * sizeof(uint16_t));
}

/****************************************************************************
 * Name:  sam_getvideoinfo
 *
 * Description:
 *   Get information about the LCD video controller configuration.
 *
 ****************************************************************************/

static int sam_getvideoinfo(FAR struct lcd_dev_s *dev,
                            FAR struct fb_videoinfo_s *vinfo)
{
  DEBUGASSERT(dev && vinfo);
  lcdinfo("fmt: %d xres: %d yres: %d nplanes: %d\n",
          g_videoinfo.fmt, g_videoinfo.xres, g_videoinfo.yres,
          g_videoinfo.nplanes);

  memcpy(vinfo, &g_videoinfo, sizeof(struct fb_videoinfo_s));
  return OK;
}

/****************************************************************************
 * Name:  sam_getplaneinfo
 *
 * Description:
 *   Get information about the configuration of each LCD color plane.
 *
 ****************************************************************************/

static int sam_getplaneinfo(FAR struct lcd_dev_s *dev, unsigned int planeno,
                              FAR struct lcd_planeinfo_s *pinfo)
{
  DEBUGASSERT(dev && pinfo && planeno == 0);
  lcdinfo("planeno: %d bpp: %d\n", planeno, g_planeinfo.bpp);
  memcpy(pinfo, &g_planeinfo, sizeof(struct lcd_planeinfo_s));
  return OK;
}

/****************************************************************************
 * Name:  sam_getpower
 *
 * Description:
 *   Get the LCD panel power status (0: full off - CONFIG_LCD_MAXPOWER: full
 *   on). On backlit LCDs, this setting may correspond to the backlight
 *   setting.
 *
 ****************************************************************************/

static int sam_getpower(struct lcd_dev_s *dev)
{
  FAR struct sam_dev_s *priv = (FAR struct sam_dev_s *)dev;

  lcdinfo("power: %d\n", 0);
  return priv->power;
}

/****************************************************************************
 * Name:  sam_setpower
 *
 * Description:
 *   Enable/disable LCD panel power (0: full off - CONFIG_LCD_MAXPOWER: full
 *   on). On backlit LCDs, this setting may correspond to the backlight
 *   setting.
 *
 ****************************************************************************/

static int sam_setpower(struct lcd_dev_s *dev, int power)
{
  FAR struct sam_dev_s *priv = (FAR struct sam_dev_s *)dev;
  int ret;

  lcdinfo("power: %d\n", power);
  DEBUGASSERT((unsigned)power <= CONFIG_LCD_MAXPOWER);

  /* Set new power level */

  if (power > 0)
    {
      /* If the display was off, then turn the display on */

