apache/nuttx/configs/samv71-xult/src/sam_ili9488.c
      if (priv->power == 0)
        {
          ret = sam_sendcmd(priv, ILI9488_CMD_PIXEL_OFF);
          if (ret < 0)
            {
              return ret;
            }

          ret = sam_sendcmd(priv, ILI9488_CMD_DISPLAY_ON);
          if (ret < 0)
            {
              return ret;
            }

          ret = sam_sendcmd(priv, ILI9488_CMD_NORMAL_DISP_MODE_ON);
          if (ret < 0)
            {
              return ret;
            }
        }

      /* Set the backlight level */

      ret = sam_set_backlight((unsigned int)power);
      up_mdelay(50);

      /* Remember the power setting */

      priv->power = power;
    }
  else
    {
      /* Turn the display off */

      ret = sam_poweroff(priv);
    }

  return ret;
}

/****************************************************************************
 * Name:  sam_getcontrast
 *
 * Description:
 *   Get the current contrast setting (0-CONFIG_LCD_MAXCONTRAST).
 *
 ****************************************************************************/

static int sam_getcontrast(struct lcd_dev_s *dev)
{
  lcdinfo("Not implemented\n");
  return -ENOSYS;
}

/****************************************************************************
 * Name:  sam_setcontrast
 *
 * Description:
 *   Set LCD panel contrast (0-CONFIG_LCD_MAXCONTRAST).
 *
 ****************************************************************************/

static int sam_setcontrast(struct lcd_dev_s *dev, unsigned int contrast)
{
  lcdinfo("contrast: %d\n", contrast);
  return -ENOSYS;
}

/****************************************************************************
 * Name:  sam_gpio_initialize
 *
 * Description:
 *   Configure LCD GPIO pins
 *
 ****************************************************************************/

static inline void sam_gpio_initialize(void)
{
  int i;

  /* Configure all LCD pins pins (backlight is initially off) */

  for (i = 0; i < LCD_NPINS; i++)
    {
      sam_configgpio(g_lcdpin[i]);
    }

  /* Backlight off */

  sam_gpiowrite(GPIO_ILI9488_BKL, true);
}

/****************************************************************************
 * Name:  sam_smc_initialize
 *
 * Description:
 *   Configure LCD SMC interface
 *
 ****************************************************************************/

static inline void sam_smc_initialize(void)
{
  uintptr_t smcbase = SAM_SMCCS_BASE(SAM_LCD_CS);
  uint32_t regval;

  /* Enable the SMC peripheral clock */

  sam_smc_enableclk();

  /* Configure SMC interface for the LCD on NCS3 */

  regval = SMCCS_SETUP_NWESETUP(2) | SMCCS_SETUP_NCSWRSETUP(0) |
           SMCCS_SETUP_NRDSETUP(0) | SMCCS_SETUP_NCSRDSETUP(0);
  putreg32(regval, smcbase + SAM_SMCCS_SETUP_OFFSET);

  regval = SMCCS_PULSE_NWEPULSE(6)  | SMCCS_PULSE_NCSWRPULSE(10) |
           SMCCS_PULSE_NRDPULSE(10) | SMCCS_PULSE_NCSRDPULSE(10);
  putreg32(regval, smcbase + SAM_SMCCS_PULSE_OFFSET);

  regval = SMCCS_CYCLE_NWECYCLE(10) | SMCCS_CYCLE_NRDCYCLE(10);
  putreg32(regval, smcbase + SAM_SMCCS_CYCLE_OFFSET);

  regval = SMCCS_MODE_READMODE | SMCCS_MODE_WRITEMODE | SMCCS_EXNWMODE_DISABLED |
           SMCCS_MODE_DBW_16BIT | SMCCS_MODE_TDFCYCLES(15);
  putreg32(regval, smcbase + SAM_SMCCS_MODE_OFFSET);
}

/****************************************************************************
 * Name:  sam_lcd_initialize
 *
 * Description:
 *   Initialize the LCD panel
 *
 ****************************************************************************/

static inline int sam_lcd_initialize(void)
{
  FAR struct sam_dev_s *priv = &g_lcddev;
  uint8_t buffer[4] = {0, 0, 0, 0};
  uint16_t id;
  uint16_t param;
  int ret;

  /* Reset the LCD and bring it out of sleep mode */

  ret = sam_lcd_put(priv, ILI9488_CMD_SOFTWARE_RESET, &param, 0);
  if (ret < 0)
    {
      return ret;
    }

  up_mdelay(200);

  sam_lcd_put(priv, ILI9488_CMD_SLEEP_OUT, &param, 0);
  if (ret < 0)
    {
      return ret;
    }

  up_mdelay(200);

  /* Configure for tRGB and reverse the column order */

  param = 0x48;
  ret = sam_lcd_put(priv, ILI9488_CMD_MEMORY_ACCESS_CONTROL, &param,
                   sizeof(uint16_t));
  if (ret < 0)
    {
      return ret;
    }

  up_mdelay(100);

  param = 0x04;
  ret = sam_lcd_put(priv, ILI9488_CMD_CABC_CONTROL_9, &param,
                   sizeof(uint16_t));
  if (ret < 0)
    {
      return ret;
    }

  /* Check the LCD ID */

  ret = sam_lcd_getreg(priv, ILI9488_CMD_READ_ID4, buffer, 4);
  if (ret < 0)
    {
      return ret;
    }

  id = ((uint16_t)buffer[2] << 8) | ((uint16_t)buffer[3] & 0xff);
  lcdinfo("ID: %04x\n", id);

  if (id != ILI9488_DEVICE_CODE)
    {
      lcderr("ERROR: Unsupported LCD ID: %04x (vs. %04x)\n",
             id, ILI9488_DEVICE_CODE);
      return -ENODEV;
    }

  /* Set the RGB565 format */

  param = 5;
  ret = sam_lcd_put(priv, ILI9488_CMD_COLMOD_PIXEL_FORMAT_SET, &param,
                   sizeof(uint16_t));
  if (ret < 0)
    {
      return ret;
    }

  ret = sam_lcd_put(priv, ILI9488_CMD_NORMAL_DISP_MODE_ON, &param, 0);
  if (ret < 0)
    {
      return ret;
    }

  ret = sam_lcd_put(priv, ILI9488_CMD_DISPLAY_ON, &param, 0);
  if (ret < 0)
    {
      return ret;
    }

  /* Landscape/portrait mode */

#if defined(CONFIG_LCD_LANDSCAPE)
  param = 0xe8;
#elif defined(CONFIG_LCD_PORTRAIT)
  param = 0x48;
#else
#  error Unsupported LCD orientation
#endif

  ret = sam_lcd_put(priv, ILI9488_CMD_MEMORY_ACCESS_CONTROL, &param,
                    sizeof(uint16_t));
  if (ret < 0)
    {
      return ret;
    }

  /* Disable the backlight */

  sam_disable_backlight();

  /* Reset the refresh window area */

  return sam_setwindow(priv, 0, 0, SAM_XRES, SAM_YRES);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name:  board_lcd_initialize
 *
 * Description:
 *   Initialize the LCD video hardware.  The initial state of the LCD is
 *   fully initialized, display memory cleared, and the LCD ready to use,
 *   but with the power setting at 0 (full off).
 *
 ****************************************************************************/

int board_lcd_initialize(void)
{
  FAR struct sam_dev_s *priv = &g_lcddev;
  int ret;

  lcdinfo("Initializing\n");

  /* Configure all LCD pins pins (backlight is initially off) */

  sam_gpio_initialize();

