apache/nuttx/configs/samv71-xult/src/sam_ili9488.c
  /* Configure SMC interface for the LCD */

  sam_smc_initialize();

  /* Initialize the LCD state structure */

  nxsem_init(&priv->waitsem, 0, 0);

  /* Allocate a DMA channel */

  priv->dmach = sam_dmachannel(0, DMA_FLAGS);
  if (!priv->dmach)
    {
      lcderr("ERROR: Failed to allocate a DMA channel\n");
      ret =  -EAGAIN;
      goto errout_with_waitsem;
    }

  /* Allocate a watchdog timer to catch DMA timeouts */

  priv->dmadog = wd_create();
  if (!priv->dmadog)
    {
      lcderr("ERROR: Failed to allocate a timer\n");
      ret = -EAGAIN;
      goto errout_with_dmach;
    }

  /* Identify and configure the LCD */

  up_mdelay(50);
  ret = sam_lcd_initialize();
  if (ret < 0)
    {
      lcderr("ERROR: sam_lcd_initialize failed: %d\n", ret);
      goto errout_with_dmadog;
    }

  /* Clear the display (setting it to the color 0=black) */

  sam_lcdclear(CONFIG_SAMV71XULT_LCD_BGCOLOR);

  /* Turn the display off */

  ret = sam_poweroff(priv);
  if (ret < 0)
    {
      lcderr("ERROR: sam_poweroff failed: %d\n", ret);
      goto errout_with_dmadog;
    }

  return OK;

errout_with_dmadog:
  wd_delete(priv->dmadog);
  priv->dmadog = NULL;

errout_with_dmach:
  sam_dmafree(priv->dmach);
  priv->dmach = NULL;

errout_with_waitsem:
  nxsem_destroy(&priv->waitsem);
  return ret;
}

/****************************************************************************
 * Name: board_lcd_getdev
 *
 * Description:
 *   Return a a reference to the LCD object for the specified LCD.  This
 *   allows support for multiple LCD devices.
 *
 ****************************************************************************/

FAR struct lcd_dev_s *board_lcd_getdev(int lcddev)
{
  DEBUGASSERT(lcddev == 0);
  return &g_lcddev.dev;
}

/****************************************************************************
 * Name:  board_lcd_uninitialize
 *
 * Description:
 *   Uninitialize the LCD support
 *
 ****************************************************************************/

void board_lcd_uninitialize(void)
{
  FAR struct sam_dev_s *priv = &g_lcddev;

  /* Free the DMA channel */

  if (priv->dmach)
    {
      sam_dmafree(priv->dmach);
      priv->dmach = NULL;
    }

  /* Free other resources */

  wd_delete(priv->dmadog);
  priv->dmadog = NULL;

  nxsem_destroy(&priv->waitsem);

  /* Put the LCD in the lowest possible power state */

  sam_poweroff(priv);
}

/****************************************************************************
 * Name:  sam_lcdclear
 *
 * Description:
 *   This is a non-standard LCD interface just for the SAMV7-XULT board.
 *   Because of the various rotations, clearing the display in the normal
 *   way by writing a sequences of runs that covers the entire display can
 *   be very slow.
 *
 ****************************************************************************/

void sam_lcdclear(uint16_t color)
{
  FAR struct sam_dev_s *priv = &g_lcddev;
  unsigned int row;
  unsigned int col;
  int ret;

  /* Create a full width run of the requested color */

  for (col = 0; col < SAM_XRES; col++)
    {
      g_runbuffer[col] = color;
    }

  /* Then write the run into the LCD for each line */

  ret = sam_setwindow(priv, 0, 0, SAM_XRES, SAM_YRES);
  if (ret < 0)
    {
      lcderr("ERROR: sam_setwindow failed: %d\n",  ret);
      return;
    }

  for (row = 0; row < SAM_YRES; row++)
    {
      ret = sam_putrun(row, 0, (FAR const uint8_t *)g_runbuffer, SAM_XRES);
      if (ret < 0)
        {
          lcderr("ERROR: sam_putrun failed on row %d: %d\n", row, ret);
          return;
        }
    }
}

#endif /* HAVE_ILI9488_SMC */
